# LeetCode SQL Solutions

## Table of Contents
1. Problem 1: [196. Delete duplication Email](https://leetcode.com/problems/delete-duplicate-emails/?envType=study-plan-v2&envId=top-sql-50)

# 196. Delete duplication Email

Table: Person

| Column Name | Type    |
|-------------|---------|
| id          | int     |
| email       | varchar |

- `id` is the primary key (column with unique values) for this table.
- Each row of this table contains an email. The emails will not contain uppercase letters.

## Problem Statement

Write a solution to delete all duplicate emails, keeping only one unique email with the smallest id.

> **Note for SQL users**: You are supposed to write a `DELETE` statement and not a `SELECT` one.

> **Note for Pandas users**: You are supposed to modify `Person` in place.

After running your script, the answer shown is the `Person` table. The driver will first compile and run your piece of code and then show the `Person` table. The final order of the `Person` table does not matter.

## Example

### Input: 
`Person` table:

| id | email            |
|----|------------------|
| 1  | john@example.com |
| 2  | bob@example.com  |
| 3  | john@example.com |

### Output: 
| id | email            |
|----|------------------|
| 1  | john@example.com |
| 2  | bob@example.com  |

**Explanation**: `john@example.com` is repeated two times. We keep the row with the smallest id = 1.

First I tried this solution:

### SQL Solution

```sql
SELECT a.name, b.salary
FROM Employee a
LEFT JOIN Salary b ON a.id = b.emp_id;

This SQL query result in an error due to the use of the SELECT subquery within a DELETE statement, as many database systems do not allow modifying a table (DELETE in this case) while also selecting from the same table in a subquery (due to issues like possible data modification conflicts).

Here are two common issues:

- Subquery modification restriction: Some SQL engines (e.g., MySQL) do not allow selecting from the same table that yo are trying to modify in the DELETE query.

- Efficient deletion: Even if the query works in some databases, it is not necessarily optimized for performance, especially if you have a large dataset.

This can be resolved as follows:

```sql
with helper as
(select min(id) as min_id from Person group by email)
delete from Person
where id not in (select min_id from helper)

# 1484. Group Sold Products By The Date


Table: Activities

| Column Name | Type    |
|-------------|---------|
| sell_date   | date    |
| product     | varchar |

- There is no primary key (column with unique values) for this table. It may contain duplicates.
- Each row of this table contains the product name and the date it was sold in a market.

### Problem Statement

Write a solution to find for each date the number of different products sold and their names.

The sold products names for each date should be sorted lexicographically.

Return the result table ordered by `sell_date`.

### Example

### Input: 
`Activities` table:

| sell_date  | product     |
|------------|-------------|
| 2020-05-30 | Headphone   |
| 2020-06-01 | Pencil      |
| 2020-06-02 | Mask        |
| 2020-05-30 | Basketball  |
| 2020-06-01 | Bible       |
| 2020-06-02 | Mask        |
| 2020-05-30 | T-Shirt     |

### Output: 
| sell_date  | num_sold | products                     |
|------------|----------|------------------------------|
| 2020-05-30 | 3        | Basketball,Headphone,T-Shirt |
| 2020-06-01 | 2        | Bible,Pencil                 |
| 2020-06-02 | 1        | Mask                         |

**Explanation**: 
- For 2020-05-30, sold items were (Headphone, Basketball, T-Shirt); they are sorted lexicographically and separated by a comma.
- For 2020-06-01, sold items were (Pencil, Bible); they are sorted lexicographically and separated by a comma.
- For 2020-06-02, the sold item is (Mask); it is returned as is.

Trick:

Utilized the `GROUP_CONCAT` function in MySQL to return row values in a comma-separated format, allowing for efficient aggregation of product names sold on specific dates.

### SQL solution

```sql
select sell_date, count(distinct product) as num_sold , GROUP_CONCAT(distinct product order by product) as products
from Activities
group by sell_date
order by sell_date, num_sold

## 1327. List the Products Ordered in a Period

Table: Products

| Column Name      | Type    |
|------------------|---------|
| product_id       | int     |
| product_name     | varchar |
| product_category | varchar |

- `product_id` is the primary key (column with unique values) for this table.
- This table contains data about the company's products.

## Table: Orders

| Column Name   | Type    |
|---------------|---------|
| product_id    | int     |
| order_date    | date    |
| unit          | int     |

- This table may have duplicate rows.
- `product_id` is a foreign key (reference column) to the Products table.
- `unit` is the number of products ordered on `order_date`.

### Problem Statement

Write a solution to get the names of products that have at least 100 units ordered in February 2020 and their amount.

Return the result table in any order.

### Example

**Input:**

Products table:

| product_id  | product_name          | product_category |
|-------------|-----------------------|------------------|
| 1           | Leetcode Solutions    | Book             |
| 2           | Jewels of Stringology | Book             |
| 3           | HP                    | Laptop           |
| 4           | Lenovo                | Laptop           |
| 5           | Leetcode Kit          | T-shirt          |

Orders table:

| product_id   | order_date   | unit     |
|--------------|--------------|----------|
| 1            | 2020-02-05   | 60       |
| 1            | 2020-02-10   | 70       |
| 2            | 2020-01-18   | 30       |
| 2            | 2020-02-11   | 80       |
| 3            | 2020-02-17   | 2        |
| 3            | 2020-02-24   | 3        |
| 4            | 2020-03-01   | 20       |
| 4            | 2020-03-04   | 30       |
| 4            | 2020-03-04   | 60       |
| 5            | 2020-02-25   | 50       |
| 5            | 2020-02-27   | 50       |
| 5            | 2020-03-01   | 50       |

**Output:**

| product_name       | unit    |
|--------------------|---------|
| Leetcode Solutions | 130     |
| Leetcode Kit       | 100     |

### Explanation

- Products with `product_id` = 1 were ordered in February for a total of (60 + 70) = 130 units.
- Products with `product_id` = 2 were ordered in February for a total of 80 units.
- Products with `product_id` = 3 were ordered in February for a total of (2 + 3) = 5 units.
- Products with `product_id` = 4 were not ordered in February 2020.
- Products with `product_id` = 5 were ordered in February for a total of (50 + 50) = 100 units.

# Trick:

`DATE_FORMAT` is a function in SQL (commonly used in MySQL) that allows you to format date values based on a specified format string. It is useful for presenting date values in different formats like YYYY-MM-DD, MM/DD/YYYY, or extracting parts of a date like the month or year.

Syntax
```sql
DATE_FORMAT(date, format)
```

- date: The date value you want to format.
- format: The string that defines the output format.
- Common Format Specifiers
- %Y: Four-digit year (e.g., 2023)
- %m: Two-digit month (e.g., 09 for September)
- %d: Two-digit day of the month (e.g., 27)
- %H: Two-digit hour (24-hour format)
- %i: Two-digit minute
- %s: Two-digit second

### SQL solution

```sql
select min(p.product_name) as product_name ,sum(o.unit) as unit
from Orders o
join Products p
on o.product_id = p.product_id
and year(o.order_date)=2020  and month(o.order_date)=2   # date_forma(o.order_date, '%Y-%m')='2020-02'
group by o.product_id
having sum(o.unit)>=100

# 1517. Find Users With Valid E-Mails

Table: Users

| Column Name | Type    |
|-------------|---------|
| user_id     | int     |
| name        | varchar |
| mail        | varchar |

- `user_id` is the primary key (column with unique values) for this table.
- This table contains information about the users signed up on a website. Some e-mails are invalid.

## Problem Statement

Write a solution to find the users who have valid emails.

A valid email has a prefix name and a domain where:

- The prefix name is a string that may contain letters (upper or lower case), digits, underscore '_', period '.', and/or dash '-'. The prefix name must start with a letter.
- The domain is `@leetcode.com`.

Return the result table in any order.

### Example

**Input:**

Users table:
| user_id | name      | mail                    |
|---------|-----------|-------------------------|
| 1       | Winston   | winston@leetcode.com    |
| 2       | Jonathan  | jonathanisgreat         |
| 3       | Annabelle | bella-@leetcode.com     |
| 4       | Sally     | sally.come@leetcode.com |
| 5       | Marwan    | quarz#2020@leetcode.com |
| 6       | David     | david69@gmail.com       |
| 7       | Shapiro   | .shapo@leetcode.com     |

**Output:**
| user_id | name      | mail                    |
|---------|-----------|-------------------------|
| 1       | Winston   | winston@leetcode.com    |
| 3       | Annabelle | bella-@leetcode.com     |
| 4       | Sally     | sally.come@leetcode.com |

### Explanation:

- The mail of user 2 does not have a domain.
- The mail of user 5 has the `#` sign which is not allowed.
- The mail of user 6 does not have the `leetcode` domain.
- The mail of user 7 starts with a period.

# Regex Summary

## Basic Syntax
- **`.`**: Matches any single character (except newline).
  - Example: `a.c` matches `abc`, `a1c`, but not `ac`.

- **`^`**: Matches the start of a string.
  - Example: `^cat` matches `cat` in "cat is here" but not in "A cat".

- **`$`**: Matches the end of a string.
  - Example: `dog$` matches `dog` in "I have a dog" but not in "dog is great".

## Character Classes
- **`[abc]`**: Matches any single character `a`, `b`, or `c`.
  - Example: `[aeiou]` matches any vowel.

- **`[^abc]`**: Matches any single character **not** in the set `a`, `b`, or `c`.
  - Example: `[^0-9]` matches any non-digit character.

- **`[a-z]`**: Matches any lowercase letter.
- **`[A-Z]`**: Matches any uppercase letter.
- **`[0-9]`**: Matches any digit.

## Quantifiers
- **`*`**: Matches 0 or more occurrences of the preceding element.
  - Example: `a*` matches `""`, `a`, `aa`, etc.

- **`+`**: Matches 1 or more occurrences of the preceding element.
  - Example: `a+` matches `a`, `aa`, etc., but not `""`.

- **`?`**: Matches 0 or 1 occurrence of the preceding element.
  - Example: `a?` matches `""` or `a`.

- **`{n}`**: Matches exactly `n` occurrences of the preceding element.
  - Example: `a{2}` matches `aa`.

- **`{n,}`**: Matches `n` or more occurrences.
  - Example: `a{2,}` matches `aa`, `aaa`, etc.

- **`{n,m}`**: Matches between `n` and `m` occurrences.
  - Example: `a{1,3}` matches `a`, `aa`, or `aaa`.

## Groups and Alternatives
- **`(abc)`**: Groups elements together. Can be used with quantifiers.
  - Example: `(ab)+` matches `ab`, `abab`, etc.

- **`|`**: Acts as a logical OR.
  - Example: `cat|dog` matches `cat` or `dog`.

## Special Characters
- **`\d`**: Matches any digit (equivalent to `[0-9]`).
- **`\D`**: Matches any non-digit.
- **`\w`**: Matches any word character (letters, digits, underscore) (equivalent to `[a-zA-Z0-9_]`).
- **`\W`**: Matches any non-word character.
- **`\s`**: Matches any whitespace character (spaces, tabs).
- **`\S`**: Matches any non-whitespace character.

## Escape Sequences
- **`\\`**: Used to escape special characters (e.g., `\.`, `\*`, `\?`).

## Examples
- **Email Validation**: `'^[a-zA-Z][a-zA-Z0-9_.-]*@example.com$'` 
- **Phone Number**: `'^\(\d{3}\) \d{3}-\d{4}$'` (matches `(123) 456-7890`)

## Usage Tips
- Always test your regex patterns to ensure they work as intended.
- Use online regex testers to visualize matches and debug patterns.

### SQL solution

```sql
select user_id , name , mail 
from Users
where 
mail  REGEXP  '^[a-zA-Z][a-zA-Z0-9_.-]*@leetcode.com$' 
and right(mail, 13)='@leetcode.com'

## 1164. Product Price at a Given Date

Table: Products

| Column Name   | Type    |
|---------------|---------|
| product_id    | int     |
| new_price     | int     |
| change_date   | date    |

- `(product_id, change_date)` is the primary key (a combination of columns with unique values) of this table.
- Each row of this table indicates that the price of a product was changed to a new price on a specific date.

### Problem Statement

Write a solution to find the prices of all products on `2019-08-16`. Assume that the price of all products before any change is 10.

Return the result table in any order.

### Example

#### Input:
Products table:

| product_id | new_price | change_date |
|------------|-----------|-------------|
| 1          | 20        | 2019-08-14  |
| 2          | 50        | 2019-08-14  |
| 1          | 30        | 2019-08-15  |
| 1          | 35        | 2019-08-16  |
| 2          | 65        | 2019-08-17  |
| 3          | 20        | 2019-08-18  |

#### Output:
| product_id | price |
|------------|-------|
| 2          | 50    |
| 1          | 35    |
| 3          | 10    |

### Explanation:

- Product `1` has a price of `35` on `2019-08-16`.
- Product `2` has a price of `50` on `2019-08-16`.
- Product `3` has no price change before `2019-08-16`, so the default price is `10`.

### SQL solution

```sql
with helper as
(select product_id, change_date, new_price as price, row_number() over (partition by product_id order by change_date DESC) as num
from Products
where change_date<='2019-08-16' )
select product_id, price
from helper 
where num=1
union
select product_id, 10 as price
from Products
where product_id not in (select distinct product_id from helper)```

`COALESCE` is a function in SQL that returns the first non-null expression among its arguments. It's often used to handle null values and provide a default value in case of NULL.

COALESCE(expression1, expression2, ..., expressionN)

- It checks the expressions in the order they are provided.
- Returns the first non-null value encountered.
- If all expressions are NULL, it returns NULL.

## using coalesce
```sql
WITH LatestPrice AS (
    SELECT product_id, 
           new_price, 
           change_date,
           ROW_NUMBER() OVER (PARTITION BY product_id ORDER BY change_date DESC) AS rn
    FROM Products
    WHERE change_date <= '2019-08-16'
)
SELECT p.product_id,
       COALESCE(lp.new_price, 10) AS price
FROM (SELECT DISTINCT product_id FROM Products) p
LEFT JOIN LatestPrice lp ON p.product_id = lp.product_id AND lp.rn = 1;
```

SyntaxError: invalid syntax (2011886389.py, line 2)